<template>
  <div class="computeIntro-container">
    <div class="computeIntro-header">
      <!-- 返回 -->
      <div class="header-back" @click="backHome">
        <img src="@/assets/images/bigData/back.png" alt="" />
        返回
      </div>
    </div>
    <div class="computeIntro-main">
      <div class="title">计算说明</div>
      <br />
      <br />
      <div class="context">
        功能室相关计算说明
        <br />
        1.功能室数量：以学校某一个学科为参考，该图表统计学校内该学科实验室的数量（不区分类型）；
        <br />
        2.功能室利用率：以学校某一个学科为参考，统计学校内该学科的实验室是否被预约成功过或者排课成功，若被预约成功或者排课成功则为已使用，未被预约成功或者排课成功则为未使用，使用过的实验室数量之和/（学校内该学科实验室总数量）（只统计类型为实验室的）；
        <br />
        3.功能室总量达标统计：以学校某一个学科为参考，该图表统计学校内该学科实验室的达标，学校该学科的实际功能室数量/对应标准数量（例如中华中学物理功能室共计5间；该学校为初中10-15轨四星级的学校，参考的标准级别为区级，标准数量为6（2类），则达标率为【5/6*100%）；
        <br />
        4.功能室类型占比：以学校一个学科为参考，统计学校内该学科各个类型的实验室的数量，从而统计出占比；
        <br />
        5.实验室使用列表：展示实验室最新的使用数据；
        <br />
        <br />
        装备相关计算说明
        <br />
        6.装备应配总量：以学校一个学科为参考，该图表统计该学校学科应配仪器数量之和（标准配备列表仪器数量之和）；7.装备实配总量：以学校一个学科为参考，该图表统计该学校该学科实际仪器库存数量之和（仪器种类在标准配备之内）；
        <br />
        8.缺配总量：应配总量-实配总量；
        <br />
        9.装备总量达标率：实配总量/应配总量；
        <br />
        10.装备种类达标率：实配达标种类总量/应配达标种类总量，一个编号即为一种仪器，一种仪器的数量达标即为该种类达标；
        <br />
        11.装备金额达标率：实配总金额/应配总金额，实配金额：仪器入库金额；应配金额：每种仪器的参考金额；
        <br />
        12.装备总量变化趋势：分别计算仪器与设备的增长趋势；以学校一个学科为参考，该图表统计该学校该学科仪器每个月库存增减之后的数量之和；
        <br />
        13.报废总量：以学校一个学科为参考，该图表统计该学校某一个学科仪器报废数量之和；
        <br />
        14.报废金额：以学校一个学科为参考，该图表统计该学校某一个学科仪器报废金额之和，
        <br />
        15.维修总量、损坏总量同报废；
        <br />
        16.生均仪器达标率：以学校为参考，先计算学校仪器设备的金额之和（所有学科的每种仪器设备的入库数量*金额之和），规定的仪器金额之和为学校所有学生数量之和*预设金额；例如小学三类学校，预设金额在生均列表中查询是200元，学校仪器设备总和为30000，学校人数为1000人，那么达标率为30000/（200*1000）=15%；
        <br />
        17.仪器利用率：以学校为例，被使用过的仪器种类/该学校仪器种类之和；
        <br />
        18.仪器状态：以学校为参考，该图标统计某一个学科仪器的状态（状态下所有仪器的数量之和）；
        <br />
        19.分类仪器达标率：计算参考仪器达标率，根据仪器所属分类，计算各个仪器分类的仪器达标率；以学校为例：先统计某一个学科的在标准之内的所属某一种分类的仪器库存总量：超过该学科应配总量的学校库存按照应配量计算；应配总数量为该学科所有仪器应配数量之和；例如玻璃仪器（烧杯、试管），其中烧杯：化学库存150，化学标准配备100，那计算该学科所有仪器库存总量时按照100计算；试管，所属玻璃仪器：化学库存20，化学标准配备100；那么玻璃仪器的达标率：（150+20）/（100+100）；
        <br />
        <br />
        实验相关计算说明
        <br />
        20.实验开课数：以学校为参考，该图表统计学校内所有学科的预约成功、排课成功、登记成功的课程数据之和；年级开课数：以学校一个班级为参考，统计学校内每个班级的预约成功、排课成功、登记成功的课程数据之和；年级开课数量统计：该年级所有班级所有学科开课数量之和；学科开课数：以学校一个班级为参考，先统计学校内该班级某一个学科的签到成功、登记成功的课程数据之和；学科开课数：学校各个班级属于该学科的签到成功、登记成功的课程数据之和；
        <br />
        21.实验开课率：以学校的某一个学科为例，统计一个班级的开课率，计划内已开课数量/应开课数量（重复开课不累计）；例如化学：九年级1班计划内已经开课8个，应开课10个实验室（根据学期内的实验计划统计），那么开课率：8/10*100%；学科开课率：该学科所有班级计划内已开课数量之和/该学科所有班级应开课数量；例如化学，共2个班，九年级1班已开8，应开10；九年级2班已开3，应开12；那么开课率：（8+3）/（10+12）*100%；
        <br />
        22.实验频次：以学校一个班级为参考，统计每个月该班级所有学科的所有预约成功、排课成功、登记成功的课程数据之和；23.实验开课数据：默认展示20条最新的开课数据，以学校为参考，需要显示各学科最新开课的数据（按上课时间倒序，最新时间为当前的时间）；
      </div>
    </div>
  </div>
</template>

<script lang="ts" setup>
import LocalCache from '@/utils/localCache'
import { useRouter } from 'vue-router'
//路由
const router = useRouter()

const backHome = () => {
  LocalCache.setCache('menuItemI', 0)
  // LocalCache.setCache('menuItemTitle', '数据中心')
  router.push('/dataPage')
}
</script>

<style lang="scss" scoped>
.computeIntro-container {
  text-align: left;
  .computeIntro-header {
    background-color: #04061c;
    padding-left: 20px;
    color: #fff;
    .header-back {
      display: flex;
      align-items: center;
      width: 60px;
      height: 60px;
      cursor: pointer;
      > img {
        width: 20px;
        height: 20px;
        margin-right: 10px;
      }
    }
  }
  .computeIntro-main {
    padding: 20px;
    .title {
      font-weight: bold;
      font-size: 18px;
    }
    .context {
      line-height: 22px;
    }
  }
}
</style>
